Revit 2027 API
BaseExportOptions.PreserveCoincidentLines Property
 Whether or not to preserve coincident lines. Default value is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool PreserveCoincidentLines { get; set; }
Public Property PreserveCoincidentLines As Boolean
	Get
	Set
public:
property bool PreserveCoincidentLines {
	bool get ();
	void set (bool value);
}
member PreserveCoincidentLines : bool with get, set
Property Value
Boolean
See Also
Reference
BaseExportOptions Class
Autodesk.Revit.DB Namespace